Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.SetModeOverride(Autodesk.Revit.DB.PointCloudColorMode,Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
Sets color settings for the given color mode.
mode:
Color mode for which color settings are set.
colorSettings:
Color settings to be set for the given color mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Checks if the contents of two settings are equal.
other:
The settings to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Assign(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Assigns values of the source settings to this object.
other:
The source settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.#ctor(Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014